7086cmd/STM32CubeMP2/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_ospi.c
/**
  ******************************************************************************
  * @file    stm32mp257f_eval_ospi.c
  * @author  MCD Application Team
  * @brief   This file includes a standard driver for the MX25L512 QSPI
  *          memory mounted on STM32MP57F_EVAL board.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */


  /* Includes ------------------------------------------------------------------*/
#include "stm32mp257f_eval_ospi.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP257F_EVAL
  * @{
  */

/** @defgroup STM32MP257F_EVAL_OSPI
  * @{
  */

/* Private variables ---------------------------------------------------------*/
OSPI_HandleTypeDef hospi2; /* Single sNOR instance */

/* Private function prototypes -----------------------------------------------*/
static void OSPI_MspInit(OSPI_HandleTypeDef *hospi);
static void OSPI_MspDeInit(OSPI_HandleTypeDef *hospi);
static uint8_t OSPI_ResetChip(void);
static uint8_t OSPI_WriteEnable(void);
static uint8_t OSPI_AutoPollingMemReady(uint32_t);
static uint8_t OSPI_ReadDeviceID(void);
static uint8_t OSPI_SetQpiMode(void);

__weak HAL_StatusTypeDef MX_OSPI_Init(OSPI_HandleTypeDef *hospi);


extern void Error_Handler(void);


/* USER CODE BEGIN 1 */

/* BSP OSPI init function */
int32_t BSP_OSPI_Init(void)
{
  /* prepare XSPI peripheral for ST-Link Utility operations */
  /* Low-level MSP Init */
  hospi2.Instance = OCTOSPI2;

  OSPI_MspInit(&hospi2);

  if (HAL_OSPI_DeInit(&hospi2) != HAL_OK)
  {
     return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Low-level MSP Init */
  OSPI_MspInit(&hospi2);

  if (MX_OSPI_Init(&hospi2) != 0)
  {
     return BSP_ERROR_PERIPH_FAILURE;
  }

  /* OSPI memory reset */
  if (OSPI_ResetChip() != 0)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  HAL_Delay(1);

  /* Enable QPI mode */
  if (OSPI_SetQpiMode() != 0)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  if (OSPI_ReadDeviceID() != 0)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Wait for the OSPI memory to become ready */
  uint32_t start = HAL_GetTick();
  while ((HAL_GetTick() - start) < HAL_OSPI_TIMEOUT_DEFAULT_VALUE)
  {
    if (BSP_OSPI_GetStatus() == BSP_ERROR_NONE)
    {
      break;
    }
  }

  return BSP_ERROR_NONE;
}

/* BSP OSPI Deinit function */
int32_t BSP_OSPI_DeInit(void)
{
  if (HAL_OSPI_DeInit(&hospi2) != HAL_OK)
  {
     return BSP_ERROR_PERIPH_FAILURE;
  }

  OSPI_MspDeInit(&hospi2);

  return BSP_ERROR_NONE;
}


/**
* @brief Get the status of the OSPI instance
* @param None
* @retval 0 if the OSPI is ready 1 otherwise
*/
int32_t BSP_OSPI_GetStatus(void)
{
  /* USER CODE BEGIN POST_OSPI_GET_STATUS */
  uint8_t status = BSP_ERROR_NONE;
  OSPI_RegularCmdTypeDef s_command;
  uint8_t reg[2];

  /* Initialize the read status register command */
  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.Instruction           = MX25L512_READ_STATUS_REG_CMD;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_4_LINES;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_NONE;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode              = HAL_OSPI_DATA_4_LINES;
  s_command.DummyCycles           = 0;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.NbData                = 1;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;

  if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Reception of the data */
  if (HAL_OSPI_Receive(&hospi2, reg, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Check the value of the register */
  if ((reg[0] & MX25L512_SR_WIP) != 0)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* USER CODE END POST_OSPI_GET_STATUS */

  return status;
}

int32_t BSP_OSPI_Erase_Chip(void)
{

  uint8_t status= BSP_ERROR_NONE;

  OSPI_RegularCmdTypeDef s_command;

  /* Initialize the erase command */
  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_4_LINES;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.NbData                = 0;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
  s_command.DataMode              = HAL_OSPI_DATA_NONE;
  s_command.DummyCycles           = 0;
  s_command.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
  s_command.Instruction           = MX25L512_BULK_ERASE_CMD;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_NONE;

  /* Enable write operations */
  if (OSPI_WriteEnable() != 0)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Send the command */
  if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  /* Configure automatic polling mode to wait for end of erase */
  if (OSPI_AutoPollingMemReady(OSPI_BULK_ERASE_MAX_TIME) != 0)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }

  return status;
}

