7086cmd/STM32CubeMP2/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_ospi.c
int32_t BSP_OSPI_EraseSector(uint32_t EraseStartAddress, uint32_t EraseEndAddress)
{
  uint8_t status = BSP_ERROR_NONE;

  OSPI_RegularCmdTypeDef s_command;

  EraseStartAddress = EraseStartAddress - EraseStartAddress % MX25L512_SECTOR_SIZE;

  /* Initialize the erase command */
  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_4_LINES;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.NbData                = 0;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
  s_command.DataMode              = HAL_OSPI_DATA_NONE;
  s_command.DummyCycles           = 0;
  s_command.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
  s_command.Instruction           = MX25L512_SECTOR_ERASE_4K_CMD;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_4_LINES;
  s_command.AddressSize           = HAL_OSPI_ADDRESS_24_BITS;

  while (EraseEndAddress >= EraseStartAddress)
  {
    s_command.Address = (EraseStartAddress & 0x0FFFFFFF);

    /* Enable write operations */
    if (OSPI_WriteEnable() != 0)
    {
        return BSP_ERROR_PERIPH_FAILURE;
    }

    /* Send the command */
    if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != 0)
    {
      return BSP_ERROR_PERIPH_FAILURE;
    }

    /* Configure automatic polling mode to wait for end of erase */
    if (OSPI_AutoPollingMemReady(OSPI_BULK_ERASE_MAX_TIME) != 0)
    {
        return BSP_ERROR_PERIPH_FAILURE;
    }

    EraseStartAddress += MX25L512_SECTOR_SIZE;
  }

  return status;
}

/**
  * @brief  Writes data into the OSPI memory.
  * @param  buffer: the source buffer
  * @param  address: the start address to write into
  * @param  buffer_size: Size of data to write
  * @retval 0 on Success 1 on Failure
  */
int32_t BSP_OSPI_WriteMemory(uint8_t* buffer, uint32_t address, uint32_t buffer_size)
{

  OSPI_RegularCmdTypeDef s_command = {0};
  uint32_t end_addr, current_size, current_addr;

  /* Calculation of the size between the write address and the end of the page */
  current_addr = 0;

  while (current_addr <= address) {
      current_addr += MX25L512_PAGE_SIZE;
  }
  current_size = current_addr - address;

  /* Check if the size of the data is less than the remaining place in the page */
  if (current_size > buffer_size) {
      current_size = buffer_size;
  }

  /* Initialize the adress variables */
  current_addr = address;
  end_addr = address + buffer_size;

  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_4_LINES;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
  s_command.Instruction           = MX25L512_PAGE_PROG_CMD;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_4_LINES;
  s_command.AddressSize           = HAL_OSPI_ADDRESS_24_BITS;
  s_command.DataMode              = HAL_OSPI_DATA_4_LINES;
  s_command.DummyCycles           = 0;

  /* Perform the write page by page */
  do {
      s_command.Address = current_addr;
      s_command.NbData  = current_size;

      if (current_size == 0)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }

      /* Enable write operations */
      if (OSPI_WriteEnable() != 0)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }

      /* Configure the command */
      if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != 0)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }

      /* Transmission of the data */

      if (HAL_OSPI_Transmit(&hospi2, (uint8_t*)buffer, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != 0)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }


      /* Configure automatic polling mode to wait for end of program */
      if (OSPI_AutoPollingMemReady(HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != 0)
      {
        return BSP_ERROR_PERIPH_FAILURE;
      }

      /* Update the address and size variables for next page programming */
      current_addr += current_size;
      buffer += current_size;
      current_size = ((current_addr + MX25L512_PAGE_SIZE) > end_addr) ? (end_addr - current_addr) : MX25L512_PAGE_SIZE;
  } while (current_addr < end_addr);

  return BSP_ERROR_NONE;
}

/**
  * @brief  Reads an amount of data from the XSPI memory.
  * @param  pData: Pointer to data to be read
  * @param  ReadAddr: Read start address
  * @param  Size: Size of data to read
  * @retval 0 on Success 1 on Failure
  */
int32_t BSP_OSPI_Read(uint8_t* pData, uint32_t ReadAddr, uint32_t Size)
{
  OSPI_RegularCmdTypeDef s_command = {0};

  /* Initialize the read command */
  s_command.Instruction           = MX25L512_4IO_FAST_READ_CMD;
  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_4_LINES;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.Address               = ReadAddr;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_4_LINES;
  s_command.AddressSize           = HAL_OSPI_ADDRESS_24_BITS;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.AlternateBytesDtrMode = HAL_OSPI_ALTERNATE_BYTES_DTR_DISABLE;
  s_command.DataMode              = HAL_OSPI_DATA_4_LINES;
  s_command.NbData                = Size;
  s_command.DummyCycles           = OSPI_DUMMY_CYCLES_CR_CFG;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;

  /* Configure the command */
  if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != 0)
  {
    return BSP_ERROR_PERIPH_FAILURE;
  }


  /* Reception of the data */

