7086cmd/STM32CubeMP2/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_ospi.c
  /* Read the status register command */
  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.Instruction           = MX25L512_MULTIPLE_IO_READ_ID_CMD;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_4_LINES;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_NONE;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode              = HAL_OSPI_DATA_4_LINES;
  s_command.DummyCycles           = 0;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.NbData                = 3;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;

  if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
  return 1;
  }

  if (HAL_OSPI_Receive(&hospi2, test_buffer, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 1;
  }
  return status;
}

/* This function enables the qpi mode of the memory */
static uint8_t OSPI_SetQpiMode(void)
{
  uint8_t status = 0;
  OSPI_RegularCmdTypeDef s_command;
  OSPI_AutoPollingTypeDef s_config;

  /* Read the status register command */
  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.Instruction           = MX25L512_ENABLE_QSPI_CMD;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_1_LINE;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_NONE;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode              = HAL_OSPI_DATA_NONE;
  s_command.DummyCycles           = 0;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.NbData                = 0;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;

  if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
  return 1;
  }

  /* Configure automatic polling mode to wait for QPI enabling */
  s_config.MatchMode              = HAL_OSPI_MATCH_MODE_AND;
  s_config.Interval               = 0x10;
  s_config.AutomaticStop          = HAL_OSPI_AUTOMATIC_STOP_ENABLE;
  s_config.Match                  = MX25L512_SR_QUADEN;
  s_config.Mask                   = MX25L512_SR_QUADEN;

  s_command.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
  s_command.FlashId               = HAL_OSPI_FLASH_ID_1;
  s_command.Instruction           = MX25L512_READ_STATUS_REG_CMD;
  s_command.InstructionMode       = HAL_OSPI_INSTRUCTION_1_LINE;
  s_command.InstructionSize       = HAL_OSPI_INSTRUCTION_8_BITS;
  s_command.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  s_command.AddressMode           = HAL_OSPI_ADDRESS_NONE;
  s_command.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode              = HAL_OSPI_DATA_1_LINE;
  s_command.DummyCycles           = 0;
  s_command.DQSMode               = HAL_OSPI_DQS_DISABLE;
  s_command.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;
  s_command.NbData                = 1;
  s_command.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;

  if (HAL_OSPI_Command(&hospi2, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 1;
  }

  if (HAL_OSPI_AutoPolling(&hospi2, &s_config, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return 1;
  }

  return status;
}

/**
  * @brief  Weak MX init (user overrideable).
  */
__weak HAL_StatusTypeDef MX_OSPI_Init(OSPI_HandleTypeDef *hospi)
{

  /* OCTOSPI2 parameter configuration*/
  hospi->Instance = OCTOSPI2;
  hospi->Init.FifoThreshold = 1;
  hospi->Init.DualQuad = HAL_OSPI_DUALQUAD_DISABLE;
  hospi->Init.MemoryType = HAL_OSPI_MEMTYPE_MACRONIX;
  hospi->Init.DeviceSize = 26;
  hospi->Init.ChipSelectHighTime = 2;
  hospi->Init.FreeRunningClock = HAL_OSPI_FREERUNCLK_DISABLE;
  hospi->Init.ClockMode = HAL_OSPI_CLOCK_MODE_0;
  hospi->Init.WrapSize = HAL_OSPI_WRAP_NOT_SUPPORTED;
  hospi->Init.ClockPrescaler = 4;
  hospi->Init.SampleShifting = HAL_OSPI_SAMPLE_SHIFTING_NONE;
  hospi->Init.DelayHoldQuarterCycle = HAL_OSPI_DHQC_DISABLE;
  hospi->Init.ChipSelectBoundary = 0;
  hospi->Init.DelayBlockBypass = HAL_OSPI_DELAY_BLOCK_BYPASSED;
  hospi->Init.MaxTran = 0;
  hospi->Init.Refresh = 0;
  if (HAL_OK != HAL_OSPI_Init(hospi))
  {
    return HAL_OSPI_ERROR_TRANSFER;
  }

  OCTOSPI2->CR &= ~(1 << 24);

  /*## IOM configuration ##*/

  CLEAR_BIT(OCTOSPI2->CR, OCTOSPI_CR_EN);

  MODIFY_REG(OCTOSPIM->CR,
    (OCTOSPIM_CR_MUXEN | OCTOSPIM_CR_MODE | OCTOSPIM_CR_CSSEL_OVR_EN
        | OCTOSPIM_CR_CSSEL_OVR_O1 | OCTOSPIM_CR_CSSEL_OVR_O2),
    (HAL_OSPIM_MUX_DISABLE | HAL_OSPIM_MODE_SWAPPED
        | HAL_OSPIM_CSSEL_OVR_DISABLE | HAL_OSPIM_CSSEL_OVR_01_NCS1
        | HAL_OSPIM_CSSEL_OVR_02_NCS1));

  SET_BIT(OCTOSPI2->CR, OCTOSPI_CR_EN);

  return HAL_OSPI_ERROR_NONE;
}

/**
* @brief OSPI MSP Initialization
* This function configures the hardware resources used
* @param hospi: OSPI handle pointer
* @retval None
*/
static void OSPI_MspInit(OSPI_HandleTypeDef* hospi)
{
  if(OCTOSPI2 == hospi->Instance)
  {
    /* USER CODE BEGIN OCTOSPI2_MspInit 0 */
    /* Acquire OCTOSPI2 peripheral via Resource Manager */
    if (RESMGR_STATUS_ACCESS_OK != ResMgr_Request(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_OCTOSPI2_ID))
    {
      Error_Handler();
    }

    /* Acquire OCTOSPI IO Manager via Resource Manager */
    if (RESMGR_STATUS_ACCESS_OK != ResMgr_Request(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_OCTOSPIM_ID))
    {
      Error_Handler();
    }

    /* Acquire GPIOD pins used by OCTOSPI2: PD0, PD3, PD4, PD5, PD6, PD7 */
    if (ResMgr_GPIO_Request(RESMGR_RESOURCE_RIF_GPIOD,
                            GPIO_PIN_0 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7)
        != RESMGR_STATUS_ACCESS_OK)
    {
      Error_Handler();
    }

