7086cmd/STM32CubeMP2/Drivers/BSP/STM32MP257F-EV1/stm32mp257f_eval_ospi.c
#if !defined(A35_STARTUP_IN_ARM_MODE)
    /* Acquire RCC resource for GPIOD bank clock */
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(93)))
    {
      __HAL_RCC_GPIOD_CLK_ENABLE();
    }

    /* Ensure VDDIO3 supply for GPIOD bank is ON */
    HAL_PWREx_EnableSupplyMonitoring(PWR_PVM_VDDIO3);
    HAL_PWREx_EnableSupply(PWR_PVM_VDDIO3);
    while (HAL_PWREx_PVM_IsBelowThreshold(PWR_PVM_VDDIO3));

#endif /*!A35_STARTUP_IN_ARM_MODE*/

    /* USER CODE END OCTOSPI2_MspInit 0 */

    /**OCTOSPI2 GPIO Configuration
    PD0     ------> OCTOSPIM_P1_CLK
    PD4     ------> OCTOSPIM_P1_IO0
    PD5     ------> OCTOSPIM_P1_IO1
    PD6     ------> OCTOSPIM_P1_IO2
    PD7     ------> OCTOSPIM_P1_IO3
    PD3     ------> OCTOSPIM_P1_NCS
    */

    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF10_OCTOSPIM_P1;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

    /* Peripheral clock enable */

    /* Enable clock and Reset the OctoSPI IO Manager interface */
    __HAL_RCC_OSPIIOM_CLK_ENABLE();
    __HAL_RCC_OSPIIOM_CLK_SLEEP_ENABLE();
    __HAL_RCC_OSPIIOM_FORCE_RESET();
    __HAL_RCC_OSPIIOM_RELEASE_RESET();

    /* Enable the OctoSPI memory interface clock and reset */
    __HAL_RCC_OSPI2_CLK_ENABLE();
    __HAL_RCC_OSPI2_FORCE_RESET();
    __HAL_RCC_OSPI2_RELEASE_RESET();

    /* OCTOSPI2 interrupt Init */
    HAL_NVIC_SetPriority(OCTOSPI2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(OCTOSPI2_IRQn);


    /* USER CODE BEGIN OCTOSPI2_MspInit 1 */

    /* USER CODE END OCTOSPI2_MspInit 1 */
  }
}

/**
* @brief OSPI MSP De-Initialization
* This function freeze the hardware resources used
* @param hospi: OSPI handle pointer
* @retval None
*/
static void OSPI_MspDeInit(OSPI_HandleTypeDef* hospi)
{
  if(hospi->Instance == OCTOSPI2)
  {
    /* USER CODE BEGIN OCTOSPI2_MspDeInit 0 */

    /* OCTOSPI2 interrupt DeInit */
    HAL_NVIC_DisableIRQ(OCTOSPI2_IRQn);

    /* Reset the OctoSPI memory interface */
    __HAL_RCC_OSPI2_FORCE_RESET();
    __HAL_RCC_OSPI2_RELEASE_RESET();

    /* DeInit GPIODs pins */
    HAL_GPIO_DeInit(GPIOD, GPIO_PIN_0 | GPIO_PIN_3 | GPIO_PIN_4 |
        GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7);

    /* Peripheral clock disable */
    __HAL_RCC_OSPI2_CLK_DISABLE();

    /* USER CODE END OCTOSPI2_MspDeInit 0 */


    /* USER CODE BEGIN OCTOSPI2_MspDeInit 1 */

    /* Release GPIOD pins reserved for OCTOSPI2 */
    (void)ResMgr_GPIO_Release(RESMGR_RESOURCE_RIF_GPIOD,
                              GPIO_PIN_0 | GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7);

#if !defined(A35_STARTUP_IN_ARM_MODE)
    /* Release RCC resource used to enable GPIOD clock */
    (void)ResMgr_Release(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(93));
#endif /*!A35_STARTUP_IN_ARM_MODE*/

    /* Release OCTOSPI2 RIFSC reservation */
    (void)ResMgr_Release(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_OCTOSPI2_ID);

    /* Release OCTOSPI IO Manager RIFSC reservation  */
    (void)ResMgr_Release(RESMGR_RESOURCE_RIFSC, STM32MP25_RIFSC_OCTOSPIM_ID);

    /* USER CODE END OCTOSPI2_MspDeInit 1 */
  }

}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
